# 提示用户连续输入最多7个整数，每个整数在1-50之间，含1、50，对于每个有效输入，程序打印对应个数的*

if __name__ == '__main__':

# ---- 我的答案：错误：因为如果输入不符合要求，也被计入了7次之内----------
    for i in range(0,7):
        j = int(input('请输入1-50之间的任意整数：'))
        if j>=1 and j<=50:
            print(j*'*')
        else:
            print('输入不正确，请输入1-50间的整数')


# -----我的修正-----
#     num = 0
#     while True:
#         if num>=7:
#             break
#         j = int(input('请输入1-50之间的任意整数：'))
#         if j >= 1 and j <= 50:
#             print(j * '*')
#             num += 1
#         else:
#             print('输入不正确，请输入1-50间的整数')


# ----参考答案----------
    for i in range(0,7):
        while True:
            j = int(input('请输入1-50之间的任意整数：'))
            if j >= 1 and j <= 50:
                print(j * '*')
                break
            else:
                print('输入不正确，请输入1-50间的整数')


# -------总结--------
# 1、在for循环中嵌套while循环：
#   1）若输入正确，则break：这样，输入正确情况下的操作次数就由for循环控制
#   2）若输入错误，则不跳出：这样，单次for循环之下会持续whilr循环，直至while循环满足条件break之后，for循环才会继续计数。
# 总之，for循环控制成功的次数，while循环控制只有成功才break，这样组合实现正确输入的次数满足条件