# 找到2000年到3200年（包括在内）中，所有可以被7整除，但不可以被5整除的所有数字，得到的数字按逗号分割，打印在一行上


if __name__ == '__main__':


#####   ---------------------- 我的答案 --------------------
    list = []
    for i in range(2000,3201):
        if i%7 == 0 and i%5 is not 0 :
            list.append(i)
        else:
            continue
    print(list)

#####   ---------------------- 参考答案 --------------------
    l1 = []
    for i in range(2000,3201):
        if (i%7==0) and (i%5 != 0):
            l1.append(str(i))
    print(','.join(l1))



#####   ---------------------- 总结 --------------------

# != 也可以写成 is not

# 字符串.join(字符串列表) ：将字符串列表中的元素，用前面字符串中的内容作为分割，输出