# 编写一个可以计算给定数阶乘的程序，结果以逗号分割，打印在一行上

#####   ---------------------- 参考答案 --------------------
def fax(x):
    if x == 0:
        return 1
    return x*fax(x-1)

if __name__ == '__main__':

#####   ---------------------- 我的答案 --------------------
    # res = 1
    # n = int(input('请输入一个正整数：'))
    # if n < 0:
    #     print('输入为负数，请重新输入')
    # if n == 0:
    #     print('0的阶乘为1')
    # if n > 0:
    #     for i in range(1,n+1):
    #         res *= i
    #     print(f'{n}的阶乘是{res}')


#####   ---------------------- 参考答案 --------------------
    print('请输入一个数字')
    x = int(input())
    print(fax(x))